Repository: murank/wxwidgetsjp
Catalog: wxwidgetsjp-level2.tmx
Source language: en_us
Languages: ja

source: This additional entry tells the HTML help controller what encoding is used in contents and index tables.
ja: この追加のエントリはコンテンツとインデックステーブルで使用されているエンコーディングを HTML ヘルプコントローラに通知します。

source: This allows enough code points (see below for the definition) sufficient to encode all of the world languages at once.
ja: これにより、 世界中の言語を一度に表現するのに十分な量のコードポイント (定義は以下を参照) が得られます。

source: This allows to have at least 65536 characters (what is called the BMP, or basic multilingual plane) and possible 2^32 of them instead of the usual 256 and is sufficient to encode all of the world languages at once.
ja: これにより、 通常の 256 文字の代わりに少なくとも 65536 文字 (これはBMP、もしくは基本多言語面と呼ばれます) 、あるいは 2^32 文字を表現することが可能であり、これは世界中の言語を一度に表現するのに十分な量です。

source: This also has the advantage that you won't have to define a new wxEvent::Clone() method for posting events between threads etc.
ja: この方法には、スレッド間でイベントを送信するための新しい wxEvent::Clone() 関数を定義する必要がないといった利点もあります。

source: This article describes how to write applications that communicate with the user in a language other than English.
ja: この概要では英語以外の言語を用いてユーザとやり取りするアプリケーションの作成方法について説明します。

source: This behaviour is controlled by flags (the second parameter of the Add() function): Zero or no flag indicates that the window will preserve it is original size, wxGROW flag (same as wxEXPAND) forces the window to grow with the sizer, and wxSHAPED flag tells the window to change it is size proportionally, preserving original aspect ratio.
ja: この振る舞いは フラグ (Add() 関数の第二引数です) によって制御されます: 0 またはフラグを何も指定しない場合、ウィンドウは元の大きさを維持します。wxGROW フラグ (wxEXPAND と同じです) はサイザーにあわせてウィンドウを強制的にリサイズします。wxSHAPED フラグは元の縦横比を維持しつつ、ウィンドウのサイズを変更します。

source: This border can either be all around, or at any combination of sides such as only above and below the control.
ja: ボーダーは全周、またはコントロールの上と下のみといった任意の組み合わせで指定できます。

source: This can avoid the need to test that the object was properly initialized in the event handlers themselves.
ja: こうすることで、イベントハンドラ内でオブジェクトが正常に初期化されているか確認する必要がなくなります。

source: This can be achieved quite simply by using the means provided by wxWidgets.
ja: これは wxWidgets の提供する方法を使うことで極めて単純に実現することができます。

source: This can be done either using new wxString::char_str() (and matching wchar_str()) method or by writing a double cast:
ja: これは新しい wxString::char_str() (や、これに対応する wchar_str()) 関数か、2 重キャストを用いることで実現できます:

source: This can be seen as a top-hierarchy column with the text at the top and buttons at the bottom and a low-hierarchy row with an OK button to the left and a Cancel button to the right.
ja: これは上部にテキストフィールドと下部にボタンを持つ上位階層の列と、左に OK ボタンと右にキャンセルボタンを持つ下位階層の行からなるでしょう。

source: This can be very convenient and is absolutely necessary for backwards compatibility with the existing code using wxWidgets however it is a rather dangerous operation as it can easily give unexpected results if the string contents isn't convertible to the current locale.
ja: この変換機能は非常に便利であり、wxWidgets を使った既存コードとの後方互換性のためには絶対に欠かすことができません。しかし、これは非常に危険な操作で、文字列の内容が現在のロケールに変換できない場合は予期しない結果を簡単に引き起こします。

source: This can even be useful if you need to do conversion in a non-Unicode build of wxWidgets; converting a string from UTF-8 to the current encoding should be possible by doing this:
ja: これは非 Unicode ビルド版の wxWidgets で変換を行なう必要がある場合に役立ちます; UTF-8 から現在のエンコーディングへの変換はおそらくこのように行われます:

source: This chain can be formed using wxEvtHandler::SetNextHandler():
ja: この連鎖は wxEvtHandler::SetNextHandler() を使用して形づくられます:

source: This class adds some simple functionality to wxEvent to facilitate inter-thread communication.
ja: このクラスはスレッド間通信を容易にするための単純な機能を wxEvent へ追加します。

source: This class allows to use all methods taking a wxInputStream reference to read in-memory data...
ja: このクラスを使用することで、メモリ内のデータを読み込むために wxInputStream のすべての関数を使用できます。

source: This class allows to use all methods taking a wxOutputStream reference to write to in-memory data...
ja: このクラスを使用することで、メモリ内へデータを書き込むために wxOutputStream のすべての関数を使用できます。

source: This class allows you to temporarily suspend logging.
ja: このクラスを用いて一時的にロギングを中断することができます。

source: This class can be used to (temporarily) redirect all output sent to a C++ ostream object to a wxTextC...
ja: このクラスは (一時的に) C++ ostream オブジェクトへ送信されたすべての出力を代わりに wxTextCtrl へリダイレクトするのに使用できます。

source: This class can be used to redirect the log messages to a C file stream (not to be confused with C++ s...
ja: このクラスはログメッセージを C のファイルストリーム (C++ のストリームと混同しないでください) へリダイレクトするのに使用できます。

source: This class can be used to redirect the log messages to a C++ stream.
ja: このクラスはログメッセージを C++ のストリームへリダイレクトするのに使用できます。

source: This class converts between any character set supported by the system and Unicode.
ja: このクラスはシステムでサポートされている任意の文字コードと Unicode とを相互変換します。

source: This class converts between the UTF-7 encoding and Unicode.
ja: このクラスは UTF-7 エンコーディングと Unicode とを変換します。

source: This class converts between the UTF-8 encoding and Unicode.
ja: このクラスは UTF-8 エンコーディングと Unicode とを変換します。

source: This class creates button layouts which conform to the standard button spacing and ordering defined b...
ja: このクラスはプラットフォームやツールキットのユーザガイドラインで定義されている標準ボタンの余白と順番に従ったレイアウトを作成します。(ただし、そのようなガイドラインが存在する場合に限ります)

source: This class encapsulates a platform-independent image.
ja: このクラスはプラットフォーム非依存の画像をカプセル化します。

source: This class encapsulates the concept of a platform-dependent bitmap, either monochrome or colour or co...
ja: このクラスはモノクロとカラーの両方について、プラットフォームに依存するビットマップの概念をカプセル化するものです。

source: This class greatly eases the burden of passing flags to a wxSizer.
ja: このクラスは wxSizer へフラグを渡す際の負担を大きく軽減してくれます。

source: This class has all the standard operations you can expect to find in a string class: dynamic memory management (string extends to accommodate new characters), construction from other strings, C strings and characters, assignment operators, access to individual characters, string concatenation and comparison, substring extraction, case conversion, trimming and padding (with spaces), searching and replacing and both C-like Printf() and stream-like insertion functions as well as much more - see wxString for a list of all functions.
ja: このクラスは文字列クラスに含まれていると考えるであろうすべての標準的な文字列操作機能を持っています: 動的なメモリ管理 (新しい文字にあわせて文字列を拡張します)、他の文字列や C 文字列からの構築、代入演算子、各文字へのアクセス、文字列の結合と比較、部分文字列の抽出、大文字小文字の変換、トリムと (スペースによる) パディング、検索と置換、C 言語風の Printf() やストリーム風の挿入関数などです。すべての関数の一覧は wxString を参照してください。

source: This class has all the standard operations you can expect to find in a string class: dynamic memory management (string extends to accommodate new characters), construction from other strings, compatibility with C strings and wide character C strings, assignment operators, access to individual characters, string concatenation and comparison, substring extraction, case conversion, trimming and padding (with spaces), searching and replacing and both C-like printf (wxString::Printf) and stream-like insertion functions as well as much more - see wxString for a list of all functions.
ja: このクラスは文字列クラスに含まれていると考えるであろうすべての標準的な文字列操作機能を持っています: 動的なメモリ管理 (新しい文字にあわせて文字列を拡張します)、他の文字列や C 文字列からの構築、代入演算子、各文字へのアクセス、文字列の結合と比較、部分文字列の抽出、大文字小文字の変換、トリムと (スペースによる) パディング、検索と置換、C 言語風の printf (wxString::Printf ) やストリーム風の挿入関数などです。すべての関数の一覧は wxString を参照してください。

source: This class implements an input stream which reads data from a connected socket.
ja: このクラスは入力ストリームを実装しており、接続されたソケットからデータを読み込みます。

source: This class implements an output stream which writes data from a connected socket.
ja: このクラスは出力ストリームを実装しており、接続されたソケットへデータを書き込みます。

source: This class is not used by the event handlers by itself, but is a base class for other event classes (...
ja: このクラスはイベントハンドラ自身では使用されませんが、(wxBookCtrlEvent などの) 他のイベントクラスの基底クラスです。

source: This class is the base class of a hierarchy of classes capable of converting text strings between mul...
ja: このクラスはマルチバイト (SBCS や DBCS) エンコーディングと Unicode との変換を行なうクラスの基底クラスです。

source: This class is the base class of most stream related classes in wxWidgets.
ja: このクラスは wxWidgets における大半のストリームクラスの基底クラスです。

source: This class is used for idle events, which are generated when the system becomes idle.
ja: このクラスはアイドルイベントに使用されます。アイドルイベントはシステムがアイドルになったときに生成されます。le.

source: This class is used to convert between multibyte encodings and UTF-16 Unicode encoding (also known as ...
ja: このクラスはマルチバイトエンコーディングと UTF-16 (UCS-2 としても知られています) とを変換するために使用されます。

source: This class is used to convert between multibyte encodings and UTF-32 Unicode encoding (also known as ...
ja: このクラスはマルチバイトエンコーディングと UTF-32 (UCS-4 としても知られています) とを変換するために使用されます。

source: This class provides a simple way to avoid flicker: when drawing on it, everything is in fact first dr...
ja: このクラスはちらつきを防止するための単純な方法を提供します: 描画時には最初にメモリ上のバッファ (wxBitmap) へすべて描画し、それから関連する wxDC を使用してスクリーン上へ一度だけ、このオブジェクトの破棄時にコピーします。

source: This class provides functions that read binary data types in a portable way.
ja: このクラスは移植性のある方法でバイナリデータを読み込む機能を提供します。

source: This class provides functions that reads text data using an input stream, allowing you to read text...
ja: このクラスは入力ストリームを利用したテキストデータの読み込み機能を提供しており、テキスト、浮動小数点、整数を読み込むことができます。

source: This class provides functions that write binary data types in a portable way.
ja: このクラスは移植性のある方法でバイナリデータを書き込む機能を提供します。

source: This class provides functions that write text data using an output stream, allowing you to write text...
ja: このクラスは出力ストリームを利用したテキストデータの書き込み機能を提供しており、テキスト、浮動小数点、整数を書き込むことができます。

source: This class represents a background log window: to be precise, it collects all log messages in the log...
ja: このクラスはバックグラウンドで動作するログウィンドウを表します。正確に言うと、このログウィンドウではログフレーム内のすべてのメッセージを収集するとともに、このクラスオブジェクトの生成時に有効だったログターゲットへ収集したメッセージを引き渡します。

source: This class represents a property sheet dialog: a tabbed dialog for showing settings.
ja: このクラスはプロパティシートダイアログ (設定を表示するためのタブ付きダイアログ) を表しています。

source: This class represents a single Unicode character.
ja: このクラスはひとつの Unicode 文字を表します。

source: This class represents a source for a drag and drop operation.
ja: このクラスはドラッグ・アンド・ドロップ操作におけるドラッグ元を表しています。

source: This class represents a target for a drag and drop operation.
ja: このクラスはドラッグ・アンド・ドロップ操作におけるドロップ先を表しています。

source: This class represents data read in from a file.
ja: このクラスはファイルからのデータ読み込みを表しています。

source: This class represents data written to a file.
ja: このクラスはファイルへのデータ書き込みを表しています。

source: This code also compiles fine under a non-Unicode build of wxWidgets, but in that case the converter is ignored.
ja: このコードは非 Unicode ビルドでも正常にコンパイルすることができますが、変換自体は行われません。

source: This could also be a simple link to the a true syscall (for example read(...), write(...)).
ja: また、この実装は単純に本当のシステムコール (read(...)、write(...) など) に関連付けられています。

source: This could also be a simple link to the true syscall (for example read(...), write(...)).
ja: また、この実装は単純に本当のシステムコール (read(...)、write(...) など) に関連付けられています。

source: This could also be done by first making a wxString of the original data:
ja: これは元データの wxString を最初に作成するときにも行われます。

source: This could be nothing in the case of wxMemoryInputStream and wxMemoryOutputStream which base themselves on wxStreamBuffer.
ja: wxStreamBuffer に基づく wxMemoryInputStream、wxMemoryOutputStream の場合は何も行いません。

source: This could be nothing in the case of wxMemoryIn/OutputStream which bases itself on wxStreamBuffer.
ja: wxStreamBuffer に基づく wxMemoryIn/OutputStream の場合は何も行いません。

source: This could look like this in your code:
ja: 以下にコード例を示します。

source: This currently works for wxMSW, wxGTK, wxMac and wxX11.
ja: これは今のところ、wxMSW、wxGTK、wxMac、wxX11 で動作します。

source: This defines the wxWidgets Encapsulated PostScript device context, which can write PostScript files o...
ja: これは wxWidets がカプセル化した PostScript デバイスコンテキストを定義しており、どのプラットフォームにおいても PostScript ファイルを作成することができます。

source: This demonstrates using the Execute, Request, and Poke commands from the client, together with an Advise loop: selecting an item in the server list box causes that item to be highlighted in the client list box.
ja: このサンプルでは Advise ループとともに Execute、Request、Poke コマンドを使用しています: サーバ側のリストボックスを選択すると、選択された項目がクライアント側のリストボックスでハイライトされます。

source: This document will attempt to clear the fog a little, and give some simple explanations of things.
ja: このドキュメントはそれらをほんの少しでも明確にするためのものであり、それらの関係性について簡単な説明を行います。

source: This doesn't work for everything (for example not all device contexts support bitmap drawing) but will work most of the time.
ja: これはすべての場合に当てはまるわけではありません (例えば、すべてのデバイスコンテキストがビットマップの描画に対応しているわけではありません) が、大半の場合はうまく行きます。

source: This enables the bitmap to be copied to a window or memory device context using wxDC::Blit(), or to be used as a drawing surface.
ja: これにより、wxDC::Blit() を使用してビットマップをウィンドウやメモリデバイスコンテキストにコピーしたり、描画先として使用したりすることができます。

source: This enables the bitmap to be copied to a window or memory device context using wxDC::Blit, or to be used as a drawing surface.
ja: これにより、wxDC::Blit を使用してビットマップをウィンドウやメモリデバイスコンテキストにコピーしたり、描画先として使用したりすることができます。

source: This ensures that in a common case of (possibly several) non-window event handlers pushed on top of a window, the event eventually reaches the window parent.
ja: これにより、ウィンドウ上に (おそらく複数の) 非ウィンドウイベントハンドラが配置されているような一般的な場合において、イベントが最終的に親ウィンドウまで確実に到達するようになります。

source: This event class contains information about command events, which originate from a variety of simple ...
ja: このイベントクラスは様々な単純コントロールから送信されるコマンドイベントに関する情報を含んでいます。

source: This event class contains information about key press and release events.
ja: このイベントクラスはキーの押下イベントや解放イベントに関する情報を含んでいます。

source: This event class contains information about navigation events, generated by navigation keys such as t...
ja: このイベントクラスはナビゲーションイベントに関する情報を含んでおり、タブやページダウンなどのナビゲーションキーから生成されます。

source: This event class contains information about socket events.
ja: このイベントクラスはソケットイベントに関する情報を含んでいます。

source: This event class contains information about the events generated by the mouse: they include mouse but...
ja: このイベントクラスはマウスによって生成されるイベントに関する情報を含んでいます: これにはマウスボタンの押下、解放イベント、およびマウスの移動イベントが含まれます。

source: This event class contains information about window and session close events.
ja: このイベントクラスはウィンドウとセッションの終了イベントに関する情報を含んでいます。

source: This event type ID is stored in a struct of type const wxEventType.
ja: このイベント ID は const wxEventType 型の構造体に格納されます。

source: This function finds all the validators in the window's children and calls the wxValidator::TransferToWindow function for each.
ja: この関数は子コントロールのすべてのバリデータを探し、それぞれの TransferToWindow を呼び出します。

source: This function finds all the validators in the window's children and calls the TransferToWindow function for each.
ja: この関数は子コントロールのすべてのバリデータを探し、それぞれの TransferToWindow を呼び出します。

source: This function simply generates a wxCloseEvent whose handler usually tries to close the window...
ja: この関数は単純に wxCloseEvent を作成します。通常はこのイベントを受け取ったハンドラはウィンドウを閉じようとします。

source: This further reduces the code size and removes the need for conversions in more cases.
ja: これはコードサイズをさらに削減させるとともに、より多くの場合で変換が不要になります。

source: This help controller provides an easy way of displaying HTML help in your application (see HTML Sampl...
ja: このヘルプコントローラはアプリケーションで HTML ヘルプを表示する簡単な方法を提供します。(HTML サンプルの test の例を参照してください)

source: This in turn generates an EVT_CLOSE event: see wxCloseEvent.
ja: そして、これは EVT_CLOSE イベントを生成します: wxCloseEvent 参照。

source: This in turn sends an initialisation event to the dialog.
ja: そして、これは初期化イベントをダイアログへ送信します。

source: This includes any children that are themselves frames or dialogs, so you may wish to close these child frame or dialog windows explicitly from within the parent close handler.
ja: これは子ウィンドウであればフレームやダイアログも含みます。そのため、親ウィンドウの終了ハンドラで明示的に子フレームや子ダイアログを終了させたいと思うかもしれません。

source: This is true of wxScreenDC, wxClientDC, wxPaintDC, and wxWindowDC.
ja: これには wxScreenDC、wxClientDC、wxPaintDC、wxWindowDC が該当します。

source: This is a drop target which accepts files (dragged from File Manager or Explorer).
ja: これは (ファイルマネージャやエクスプローラからドラッグされた) ファイルを受け付けるドロップ先です。

source: This is a general overview of logging classes provided by wxWidgets.
ja: これは wxWidgets の提供するロギングクラス全般の概要です。

source: This is a specialization of wxCharTypeBuffer<T> for char type.
ja: これは char 型による wxCharTypeBuffer<T> の特殊化です。

source: This is a specialization of wxCharTypeBuffer<T> for wchar_t type.
ja: これは wchar_t 型による wxCharTypeBuffer<T> の特殊化です。

source: This is a subclass of wxBufferedDC which can be used inside of an EVT_PAINT() event handler to achiev...
ja: これは wxBufferedDC のサブクラスで、ダブルバッファリングを行なうために EVT_PAINT() イベントハンドラの内部で使用できます。

source: This is a type of device context that allows a metafile object to be created (Windows only)...
ja: これはメタファイルオブジェクトを作成するためのデバイスコンテキスト型で (Windows のみ)、通常の wxDC の特徴の大半を備えています。

source: This is achieved by using the standard C (and C++) way: just put the letter 'L' after any string constant and it becomes a long constant, i.e. a wide character one.
ja: これは標準的な C (および C++) の方法で実現されます: 文字列定数の後ろに 'L' という文字を配置するだけで、 long 定数、すなわちワイド文字になります。

source: This is also the approach used by wxString.
ja: これは wxString で採用されている方法でもあります。

source: This is because Windows 3 expects the contents of a modal dialog to be loaded from a resource file or created on receipt of a dialog initialization message.
ja: これは、Windows 3 ではモーダルダイアログの内容はリソースファイルから読み込むか、ダイアログの初期化メッセージを受信したときに作成する必要があるためです。

source: This is because for some window classes, wxWidgets delays actual deletion of the window until all events have been processed, since otherwise there is the danger that events will be sent to a non-existent window.
ja: これは、いくつかのウィンドウクラスではすべてのイベントが処理されるまでウィンドウを実際に削除しないためです。このようにしない場合、イベントが存在しないウィンドウに送信される危険性があります。

source: This is determined by the proportion parameter when adding a window (or another sizer) to a sizer.
ja: これはウィンドウ (または他のサイザー) をサイザーへ追加するときの プロポーション パラメータによって決定されます。

source: This is done as follows, in wxDialogLayoutAdapter::DoLayoutAdaptation called from within wxDialog::Show or wxDialog::ShowModal:
ja: wxDialog::Show や wxDialog::ShowModalから呼ばれた wxDialogLayoutAdapter::DoLayoutAdaptation の中では次のように処理が行われます:

source: This is done in the document/view framework, for example, to allow event handlers to be defined in the document or view.
ja: これは例えば、ドキュメント/ビューフレームワークがドキュメントやビューでイベントハンドラを定義するために行います。

source: This is done using wxDEFINE_EVENT() macro.
ja: これは wxDEFINE_EVENT() マクロによって行います。

source: This is important because validators are passed by reference to window constructors, and must therefore be cloned internally.
ja: バリデータはウィンドウのコンストラクタへ参照渡しされるため、内部的に複製しなければならないという点でこれは重要です。

source: This is impossible to do with the event tables because it is not possible to specify these handlers to dispatch the event to, so it necessarily needs to be sent to the same object which generated the event.
ja: これはイベントテーブルでは実現不可能です。なぜなら、イベントのディスパッチ先としてこれらのハンドラを指定することができないためです。そのため、イベントはそれを生成したオブジェクトに対して送信される必要があります。

source: This is normally the expected behaviour and means that it is enough to call Close() in response to the "Exit" menu command if your program has a single top level window.
ja: これは通常期待する振る舞いであり、アプリケーションが単一のトップレベルウィンドウを持つ場合は "Exit" メニューが選択されたときに Close() を呼ぶだけで充分なことを意味します。

source: This is normally the expected behaviour and means that it is enough to call wxWindow::Close() in response to the "Exit" menu command if your program has a single top level window.
ja: これは通常期待する振る舞いであり、アプリケーションが単一のトップレベルウィンドウを持つ場合は "Exit" メニューが選択されたときに wxWindow::Close() を呼ぶだけで充分なことを意味します。

source: This is not a problem if you simply call these functions but you need to change the signature of the derived class versions if you override them as otherwise they wouldn't be called any more.
ja: 関数を単純に呼び出しているのであれば問題になりませんが、これらの関数をオーバーライドしている場合、そのシグネチャの関数はもはや呼び出されなくなるため、継承クラスのシグネチャを変更する必要があります。

source: This is quite a common situation and not allocating extra memory at all would lead to very bad performance in this case because there would be as many memory (re)allocations as there are consonants in the original string.
ja: これは非常によくある状況であり、余分なメモリを割り当てない場合、著しい性能劣化を引き起こします。これは元の文字列に含まれる文字数分、メモリの (再) 割り当てが行われるためです。

source: This is supported only by wxBoxSizer and wxFlexGridSizer.
ja: これは wxBoxSizer と wxFlexGridSizer でのみサポートされています。

source: This is the base class for implementing bitmap file loading/saving, and bitmap creation from data...
ja: これはビットマップファイルの読み書き、およびデータからのビットマップの作成を実装するための基底クラスです。

source: This is the default behaviour of the wxLocale class; you can disable it by not passing wxLOCALE_CONV_ENCODING to wxLocale::Init.
ja: これが wxLocale クラスのデフォルトの振る舞いです; wxLocale::Init に wxLOCALE_CONV_ENCODING を渡さ ない ことでこれを無効化できます。

source: This is the default log target for the GUI wxWidgets applications.
ja: これは GUI wxWidgets アプリケーションのデフォルトのログターゲットです。

source: This is too restrictive for wxWidgets, where any window may be created and displayed before its contents are created.
ja: wxWidgets ではウィンドウの内容が作成される前にウィンドウを作成して表示するため、これは wxWIdgets にとって制約になってしまいます。

source: This is useful when hiding parts of the interface, since you can avoid removing the controls from the sizer and having to add them back later.
ja: コントロールをサイザーから削除し、後で追加し直す必要がないため、これはインタフェースの一部を隠すときに役立ちます。

source: This is useful when you don't care about the exact identifier either because you're not going to process the events from the control being created at all or because you process the events from all controls in one place (in which case you should specify wxID_ANY in the event table or wxEvtHandler::Connect call as well.
ja: コントロールの生成するイベントを処理しない場合や、イベントを一箇所で処理する場合 (このときはイベントテーブルに wxID_ANY を指定するか、それと同様に wxEvtHandler::Connect を呼ぶ必要があります) など、コントロールの正確な識別子が必要でないときにこれは役立ちます。

source: This is useful when you don't care about the exact identifier either because you're not going to process the events from the control being created or because you process the events from all controls in one place (in which case you should specify wxID_ANY in the event table or wxEvtHandler::Bind call as well).
ja: コントロールの生成するイベントを処理しない場合や、イベントを一箇所で処理する場合 (このときはイベントテーブルに wxID_ANY を指定するか、同じように wxEvtHandler::Bind を呼ぶ必要があります) など、コントロールの正確な識別子が必要でないときにこれは役立ちます。

source: This is why in addition to all wxString functions, there are also a few global string functions which try to correct these problems: wxIsEmpty() verifies whether the string is empty (returning true for NULL pointers), wxStrlen() also handles NULL correctly and returns 0 for them and wxStricmp() is just a platform-independent version of case-insensitive string comparison function known either as stricmp() or strcasecmp() on different platforms.
ja: これが wxString の関数に加えて若干のグローバル文字列関数が存在する理由です: wxIsEmpty() は文字列が空かどうかを確かめます。(NULL ポインタに対しては true を返却します) wxStrlen() も NULL を正しく取り扱うことができ、NULL の場合は 0 を返却します。 wxStricmp() は単なるプラットフォーム非依存の大文字小文字を区別しない文字列比較関数で、プラットフォームによっては stricmp() や strcasecmp() として知られています。

source: This is why in addition to all wxString functions, there are also a few global string functions which try to correct these problems: wxIsEmpty() verifies whether the string is empty (returning true for NULL pointers), wxStrlen() also handles NULLs correctly and returns 0 for them and wxStricmp() is just a platform-independent version of case-insensitive string comparison function known either as stricmp() or strcasecmp() on different platforms.
ja: これが wxString の関数に加えて若干のグローバル文字列関数が存在する理由です: wxIsEmpty() は文字列が空かどうかを確かめます。(NULL ポインタに対しては true を返却します) wxStrlen() も NULL を正しく取り扱うことができ、NULL の場合は 0 を返却します。 wxStricmp() は単なるプラットフォーム非依存の大文字小文字を区別しない文字列比較関数で、プラットフォームによっては stricmp() や strcasecmp() として知られています。

source: This leads us to the following general advice: all functions taking string arguments should take const wxString& (this makes assignment to the strings inside the function faster) and all functions returning strings should return wxString - this makes it safe to return local variables.
ja: このことから、次のような一般的なアドバイスが可能です: 文字列を引数として受け取るすべての関数は const wxString& を受け取るべきで (こうすることで内部文字列への代入が早くなります)、文字列を返却するすべての関数は wxString を返却するべきです (これにより、安全にローカル変数を返却することができます)。
